Revit 2027 API
CentralModelContentionException.CurrentUser Property
Retrieves current user name.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CurrentUser { get; }
Public ReadOnly Property CurrentUser As String
	Get
public:
property String^ CurrentUser {
	String^ get ();
}
member CurrentUser : string with get
Property Value
String
See Also
Reference
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace